nemuisan/STM32Primer2_GNSS_Tracker/inc/hw_config.h
/********************************************************************************/
/*!
	@file			hw_config.h
	@author         Nemui Trinomius (https://nemuisan.blog.bai.ne.jp)
    @version        11.00
    @date           2025.12.03
	@brief          Configure Basis System on STM32Primer2.

    @section HISTORY
		2010.12.31	V1.00	Restart Here.
		2011.03.10	V2.00	C++ Ready.
		2022.10.15	V3.00	Fixed cosmetic bugfixes.
		2023.04.21	V4.00	Re-Fixed cosmetic bugfix.
		2023.06.01	V5.00	Added MTK_Command mode at gnss logging.
		2025.04.07	V6.00	Fixed typo comment.
		2025.04.21	V7.00	Re-defined NVIC priority settings.
		2025.05.03	V8.00	Fixed cosmetic bugfix.
		2025.06.19	V9.00	Fixed implicit cast warnings.
		2025.09.29 V10.00	Fixed invalid PCLK1 frequency setting at 72MHz.
		2025.12.03 V11.00	Fixed typo and wrong description.

    @section LICENSE
		BSD License. See Copyright.txt
*/
/********************************************************************************/
#ifndef HW_CONFIG_H
#define HW_CONFIG_H 0x1100

#ifdef __cplusplus
 extern "C" {
#endif

/* General inclusion */
#include <stdio.h>
#include <stdlib.h>
#include <string.h>
#include <inttypes.h>
#include <stdbool.h>
#include "stm32f10x_it.h"
#include "stm32f10x_conf.h"
#include "platform_config.h"

/* Function inclusion */
#include "systick.h"
#include "pwr_support.h"
#include "adc_support.h"
#include "rtc_support.h"
#include "uart_support_gps.h"
#include "sdio_stm32f1.h"
#include "xprintf.h"

/* High level function */
#include "ff.h"
#include "diskio.h"
#include "gnss_support.h"
#include "cdc_support.h"
#include "msc_support.h"


/* Macros */
#define countof(a)   	(sizeof(a) / sizeof(*(a)))

/* Function modes enumeration */
enum{ 
		NO_SELECTED,
		GNSS_LOGGING,
		GNSS_LOGGING_MTK,
		USB_MSC,
		USB_VCOM
	};

/* LED */
#define	LED_GRN_ON()	GPIO_SetBits(GPIO_LED, LED_GREEN)
#define	LED_GRN_OFF()	GPIO_ResetBits(GPIO_LED, LED_GREEN)
#define	LED_RED_ON()	GPIO_SetBits(GPIO_LED, LED_RED)
#define	LED_RED_OFF()	GPIO_ResetBits(GPIO_LED, LED_RED)
#define Led_RW_ON()		LED_GRN_ON()
#define Led_RW_OFF()	LED_GRN_OFF()

/* Externals */
extern void Set_System(void);
extern void NVIC_Configuration(void);
extern void LED_Configuration(void);
extern void KEY_Configuration(void);
extern void JoyInp_Chk(void);

/* USB Device relation */
extern void Set_USBClock(void);
extern void SetSysClock72(void);
extern void Enter_LowPowerMode(void);
extern void Leave_LowPowerMode(void);
extern void USB_Cable_Config (FunctionalState NewState);
extern void Get_SerialNum(uint8_t* string0,uint8_t* string1);
extern void USB_Disconnect_Config(void);

/* System global variables */
extern __IO uint16_t CmdKey;
extern __IO int TaskStat;

#ifdef __cplusplus
}
#endif

#endif	/* HW_CONFIG_H */
